&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    ЗагрузитьТекст();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
    ЗагрузитьТекст();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьТекст()
    Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
        ТекстСообщения = Строка(Объект.Ссылка.ПолезнаяНагрузка.Получить());
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Повторить(Команда)
    ПовторитьНаСервере();
    Прочитать();
КонецПроцедуры

&НаСервере
Процедура ПовторитьНаСервере()
    РабочееМестоТестированияСервер.ПовторитьСообщение(Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
    Прочитать();
КонецПроцедуры
