Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если Не ЗначениеЗаполнено(ИдентификаторВарианта) Тогда
		ИдентификаторВарианта = Новый УникальныйИдентификатор;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ИдентификаторВерсииВарианта) Тогда
		ИдентификаторВерсииВарианта = Новый УникальныйИдентификатор;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЭтотОбъект.Наименование) Тогда
		
		ЭтотОбъект.Наименование = СтрШаблон("%1_%2", ЭтотОбъект.Владелец, ЭтотОбъект.Порядок);
		
	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ПроверитьДоступностьИзмененияВерсии();
    Наименование = Лев(Строка(ТекстВарианта), 150);

	Если Не ЗначениеЗаполнено(ИдентификаторВарианта) Тогда
		ИдентификаторВарианта = Новый УникальныйИдентификатор;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ИдентификаторВерсииВарианта) Тогда
		ИдентификаторВерсииВарианта = Новый УникальныйИдентификатор;
	КонецЕсли;

	Если Порядок < 1 Тогда
		ВызватьИсключение "Порядок варианта ответа должен быть положительным.";
	КонецЕсли;

	Если ПустаяСтрока(СокрЛП(Строка(ТекстВарианта))) Тогда
		ВызватьИсключение "Не заполнен текст варианта ответа.";
	КонецЕсли;

	ПроверитьУникальность();

КонецПроцедуры

Процедура ПередУдалением(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ПроверитьДоступностьИзмененияВерсии();

КонецПроцедуры

Процедура ПроверитьДоступностьИзмененияВерсии()
    Если Не ЭтоНовый() Тогда
        ПрежняяВерсия = Ссылка.Владелец.Владелец;
        Если ЗначениеЗаполнено(ПрежняяВерсия) И ПрежняяВерсия.СтатусВерсии <> Перечисления.СтатусыВерсийТестов.Черновик Тогда
            ВызватьИсключение "Содержимое опубликованной версии нельзя изменять или переносить.";
        КонецЕсли;
    КонецЕсли;

	Если Не ЗначениеЗаполнено(Владелец)
		Или Не ЗначениеЗаполнено(Владелец.Владелец) Тогда
		ВызватьИсключение "Вариант должен принадлежать вопросу версии теста.";
	КонецЕсли;

	Если Владелец.Владелец.СтатусВерсии
		<> Перечисления.СтатусыВерсийТестов.Черновик Тогда
		ВызватьИсключение "Варианты опубликованной версии нельзя изменять.";
	КонецЕсли;

КонецПроцедуры

Процедура ПроверитьУникальность()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Варианты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВариантыОтветовВерсий КАК Варианты
	|ГДЕ
	|	Варианты.Ссылка <> &Ссылка
	|	И (Варианты.ИдентификаторВерсииВарианта = &ИдентификаторВерсииВарианта
	|		ИЛИ (Варианты.Владелец = &Владелец
	|			И Варианты.Порядок = &Порядок))";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ИдентификаторВерсииВарианта", ИдентификаторВерсииВарианта);
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Запрос.УстановитьПараметр("Порядок", Порядок);

	Если Не Запрос.Выполнить().Пустой() Тогда
		ВызватьИсключение "Идентификатор версии варианта или порядок уже используется.";
	КонецЕсли;

КонецПроцедуры
