Процедура ИсполняемыеСценарии() Экспорт
    ЮТТесты.ДобавитьТестовыйНабор("Открытие форм интерфейса 8.5");
    ЮТТесты.ДобавитьТест("РабочееМесто");
    ЮТТесты.ДобавитьТест("НастройкиОбмена");
    ЮТТесты.ДобавитьТест("КарточкаТеста");
    ЮТТесты.ДобавитьТест("РедакторВерсии");
    ЮТТесты.ДобавитьТест("РедакторВопроса");
    ЮТТесты.ДобавитьТест("ВариантОтвета");
    ЮТТесты.ДобавитьТест("Результат");
    ЮТТесты.ДобавитьТест("СообщениеОбмена");
    ЮТТесты.ДобавитьТест("СписокТестов");
    ЮТТесты.ДобавитьТест("СписокРезультатов");
    ЮТТесты.ДобавитьТест("Отчет");
КонецПроцедуры

Процедура РабочееМесто() Экспорт
    Форма = ПолучитьФорму("Обработка.РабочееМестоАдминистратора.Форма.Форма");
    Форма.Открыть();
    ЮТест.ОжидаетЧто(Форма.Открыта()).Равно(Истина);
    Форма.Модифицированность = Ложь;
    Форма.Закрыть();
КонецПроцедуры

Процедура НастройкиОбмена() Экспорт
    Форма = ПолучитьФорму("Обработка.НастройкиИнтеграции.Форма.Форма");
    Форма.Открыть();
    ЮТест.ОжидаетЧто(Форма.Открыта()).Равно(Истина);
    Форма.Модифицированность = Ложь;
    Форма.Закрыть();
КонецПроцедуры

Процедура КарточкаТеста() Экспорт
    Форма = ПолучитьФорму("Справочник.Тесты.Форма.ФормаЭлемента");
    Форма.Открыть();
    ЮТест.ОжидаетЧто(Форма.Открыта()).Равно(Истина);
    Форма.Модифицированность = Ложь;
    Форма.Закрыть();
КонецПроцедуры

Процедура РедакторВерсии() Экспорт
    Форма = ПолучитьФорму("Справочник.ВерсииТестов.Форма.ФормаЭлемента");
    Форма.Открыть();
    ЮТест.ОжидаетЧто(Форма.Открыта()).Равно(Истина);
    Форма.Модифицированность = Ложь;
    Форма.Закрыть();
КонецПроцедуры

Процедура РедакторВопроса() Экспорт
    Форма = ПолучитьФорму("Справочник.ВопросыВерсийТестов.Форма.ФормаЭлемента");
    Форма.Открыть();
    ЮТест.ОжидаетЧто(Форма.Открыта()).Равно(Истина);
    Форма.Модифицированность = Ложь;
    Форма.Закрыть();
КонецПроцедуры

Процедура ВариантОтвета() Экспорт
    Форма = ПолучитьФорму("Справочник.ВариантыОтветовВерсий.Форма.ФормаЭлемента");
    Форма.Открыть();
    ЮТест.ОжидаетЧто(Форма.Открыта()).Равно(Истина);
    Форма.Модифицированность = Ложь;
    Форма.Закрыть();
КонецПроцедуры

Процедура Результат() Экспорт
    Форма = ПолучитьФорму("Документ.РезультатПопытки.Форма.ФормаЭлемента");
    Форма.Открыть();
    ЮТест.ОжидаетЧто(Форма.Открыта()).Равно(Истина);
    Форма.Модифицированность = Ложь;
    Форма.Закрыть();
КонецПроцедуры

Процедура СообщениеОбмена() Экспорт
    Форма = ПолучитьФорму("Справочник.СообщенияОбмена.Форма.ФормаЭлемента");
    Форма.Открыть();
    ЮТест.ОжидаетЧто(Форма.Открыта()).Равно(Истина);
    Форма.Модифицированность = Ложь;
    Форма.Закрыть();
КонецПроцедуры

Процедура СписокТестов() Экспорт
    Форма = ПолучитьФорму("Справочник.Тесты.ФормаСписка");
    Форма.Открыть();
    ЮТест.ОжидаетЧто(Форма.Открыта()).Равно(Истина);
    Форма.Модифицированность = Ложь;
    Форма.Закрыть();
КонецПроцедуры

Процедура СписокРезультатов() Экспорт
    Форма = ПолучитьФорму("Документ.РезультатПопытки.ФормаСписка");
    Форма.Открыть();
    ЮТест.ОжидаетЧто(Форма.Открыта()).Равно(Истина);
    Форма.Модифицированность = Ложь;
    Форма.Закрыть();
КонецПроцедуры

Процедура Отчет() Экспорт
    Форма = ПолучитьФорму("Отчет.РезультатыТестирования.ФормаОтчета");
    Форма.Открыть();
    ЮТест.ОжидаетЧто(Форма.Открыта()).Равно(Истина);
    Форма.Модифицированность = Ложь;
    Форма.Закрыть();
КонецПроцедуры
