&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    Элементы.РучнаяПроверка.Видимость = ПравоДоступа("Изменение", Метаданные.Документы.РезультатПопытки);
КонецПроцедуры

&НаКлиенте
Процедура ПринятьОтвет(Команда)
    ПроверитьТекущийОтвет(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОтклонитьОтвет(Команда)
    ПроверитьТекущийОтвет(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьТекущийОтвет(Принят)
    Строка = Элементы.Ответы.ТекущиеДанные;
    Если Строка = Неопределено Тогда Возврат; КонецЕсли;
    ПроверитьНаСервере(Строка.ИдентификаторОтвета, Принят);
    КомментарийРецензента = "";
    Прочитать();
КонецПроцедуры

&НаСервере
Процедура ПроверитьНаСервере(ИдентификаторОтвета, Принят)
    РабочееМестоТестированияСервер.ПроверитьОтветВручную(Объект.Ссылка, ИдентификаторОтвета, Принят, КомментарийРецензента);
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
    Прочитать();
КонецПроцедуры
