&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    Если Не ЗначениеЗаполнено(Объект.Ссылка) И Объект.Порядок = 0 Тогда
        Объект.Порядок = РабочееМестоТестированияСервер.СледующийПорядок("ВариантыОтветовВерсий", Объект.Владелец);
    КонецЕсли;
    ОбновитьДанные();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
    ОбновитьДанные();
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанные()
    Элементы.Данные.ТолькоПросмотр = ЗначениеЗаполнено(Объект.Владелец) И Объект.Владелец.Владелец.СтатусВерсии <> Перечисления.СтатусыВерсийТестов.Черновик;
    
КонецПроцедуры
